{
  "backend/main.mo": "Defines the backend actor and all domain data types for CRM, portal, documents, finance, and NPS systems.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for all frontend files used for build planning.",
  "frontend/index.css": "Empty stylesheet placeholder for global CSS.",
  "frontend/index.html": "HTML entrypoint that loads fonts and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app wrapper configuring Router, QueryClient, theming, auth, org context, and toast behavior.",
  "frontend/src/app/layout/AppShell.tsx": "Layout component that renders topbar, sidebar, and bottom navigation when authenticated.",
  "frontend/src/app/layout/BottomNav.tsx": "Mobile bottom navigation bar with links to dashboard, contacts, portal, and a slide‑out menu.",
  "frontend/src/app/layout/MobileNavMenu.tsx": "Mobile side menu showing internal and portal navigation sections with role‑based visibility.",
  "frontend/src/app/layout/Sidebar.tsx": "Renders a sidebar with internal and portal navigation items based on authentication and role permissions.",
  "frontend/src/app/layout/Topbar.tsx": "Displays the top navigation bar with logo, current organization, and user menu including logout and org switch.",
  "frontend/src/app/router/PostAuthLanding.tsx": "Redirects authenticated users to the correct page based on role and organization state.",
  "frontend/src/app/router/ProtectedRoute.tsx": "Guards routes by requiring authentication and optionally an organization, showing loading or access denied states.",
  "frontend/src/app/router/routes.tsx": "Defines the application's full routing structure with protected internal and portal routes.",
  "frontend/src/app/router/routeTree.tsx": "Empty placeholder for route tree setup.",
  "frontend/src/auth/AuthProvider.tsx": "Provides authentication via Internet Identity, loading user profiles and exposing login/logout state.",
  "frontend/src/auth/InternetIdentityAuthAdapter.ts": "Adapts Internet Identity and backend profile data into the app's user model and maps roles.",
  "frontend/src/auth/MockAuthProvider.tsx": "Empty mock auth provider placeholder.",
  "frontend/src/auth/roles.ts": "Defines app roles, permissions, and helper functions for permission checks.",
  "frontend/src/components/BrandLogo.tsx": "Displays the brand logo image with a text fallback on load error.",
  "frontend/src/components/states/AccessDeniedScreen.tsx": "UI screen showing an access denied message with a button to return home.",
  "frontend/src/components/states/BackendClientInitState.tsx": "UI component that displays loading, error with retry, or children during backend client initialization.",
  "frontend/src/components/states/QueryBoundary.tsx": "Wrapper component that shows loading, error, or empty states for React Query before rendering children.",
  "frontend/src/components/states/UiStates.tsx": "Provides reusable loading, error, and empty state UI elements with optional messages and actions.",
  "frontend/src/config/dataMode.ts": "Defines data mode as always BACKEND and provides helpers reflecting removal of mock mode.",
  "frontend/src/data/api/backendClient.ts": "Implements DataClient using a backend actor, mapping roles and exposing org, profile, and placeholder project/task operations.",
  "frontend/src/data/client.ts": "Defines the DataClient interface and exports the backend client factory for unified backend routing.",
  "frontend/src/data/mock/mockClient.ts": "Empty placeholder for mock client implementation.",
  "frontend/src/data/mock/seed.ts": "Empty placeholder for mock data seeding.",
  "frontend/src/hooks/useActor.ts": "React hook that initializes and caches a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login management, identity loading, and AuthClient setup.",
  "frontend/src/hooks/useStage1Client.ts": "Hook that wraps backend client creation, exposing ready/loading/error states and a retry mechanism.",
  "frontend/src/i18n/strings.ptBR.ts": "Centralized Portuguese UI strings for actions, states, errors, success messages, and navigation.",
  "frontend/src/index.css": "Defines Tailwind layers, custom color variables for light/dark themes, global styles, and utility classes like glass and page transitions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, then renders App.",
  "frontend/src/org/OrgProvider.tsx": "Provides organization context, loads the user's current org from backend, and manages selection state.",
  "frontend/src/pages/auth/CreateOrganizationPage.tsx": "Form to create a new organization, call backend, update context, refresh queries, and redirect to dashboard.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login screen using Internet Identity with redirect if already authenticated.",
  "frontend/src/pages/auth/SelectOrganizationPage.tsx": "Lists organizations for selection, supports org creation for non-Firsty users, and updates current org.",
  "frontend/src/pages/auth/SignupPage.tsx": "Mock signup form with validation and redirect to login after simulated submission.",
  "frontend/src/pages/internal/ActivitiesPage.tsx": "Displays activities, fetches related data, and includes a modal to create new activities via mutations.",
  "frontend/src/pages/internal/ContactsPage.tsx": "Contacts CRUD page using react-query, dialogs, and mutations to list, create, update, and delete contacts for the current organization.",
  "frontend/src/pages/internal/ContractsPage.tsx": "Lists recurring contracts, computes MRR metrics, filters by status, and provides a dialog to create new contracts.",
  "frontend/src/pages/internal/customer-success/NpsResponseDialog.tsx": "Modal dialog for submitting NPS responses, validating inputs and handling disabled state when no active campaign. Allows selecting a contact, score, and optional comment.",
  "frontend/src/pages/internal/CustomerSuccessPage.tsx": "Customer success dashboard with health, NPS, and churn views, including campaign creation and NPS response handling.",
  "frontend/src/pages/internal/DashboardPage.tsx": "Overview dashboard aggregating contacts, deals, contracts, and activities to compute MRR, pipeline value, and recent activity.",
  "frontend/src/pages/internal/DealDetailPage.tsx": "Detail view for a single deal showing its metadata, contact info, status, and stage fetched via react-query.",
  "frontend/src/pages/internal/FinancePage.tsx": "Implements a finance dashboard that lists, filters, and creates transactions using React Query and a modal form. Calculates totals, balance, and recurring metrics for display.",
  "frontend/src/pages/internal/PipelinePage.tsx": "Manages sales pipeline deals with listing, filtering, and CRUD dialogs, integrating contacts and using React Query mutations. Supports stage-based filtering and navigation to deal details.",
  "frontend/src/pages/internal/ReportsPage.tsx": "Displays static report cards, export history, and controls for selecting period and format. Provides UI for triggering report generation.",
  "frontend/src/pages/internal/settings/TeamManagementTab.tsx": "UI for viewing members, pending invitations, and sending new team invites using react-query and Stage1 client.",
  "frontend/src/pages/internal/SettingsPage.tsx": "Renders organization settings with tabs for general info, team, notifications, security, and integrations. Includes editable fields for org details and preferences.",
  "frontend/src/pages/portal/DeliverablesPage.tsx": "Displays project deliverables grouped by status with filters and loading/error handling via react-query.",
  "frontend/src/pages/portal/DocumentsPage.tsx": "Lists organization documents and provides a dialog for uploading categorized files with progress tracking.",
  "frontend/src/pages/portal/KpisPage.tsx": "Fetches and displays project KPIs with trend indicators and updated timestamps.",
  "frontend/src/pages/portal/MeetingsPage.tsx": "Shows upcoming and past meetings for a project and allows creating new meetings via a modal form.",
  "frontend/src/pages/portal/MessagesPage.tsx": "Displays a support message thread for the current org, with message loading, sending, and role badges.",
  "frontend/src/pages/portal/PortalSettingsPage.tsx": "Provides UI for mock portal settings with toggles and tabbed sections for notifications, display, and privacy.",
  "frontend/src/pages/portal/ProjectDashboardPage.tsx": "Shows selectable projects and a detailed dashboard for the active project using React Query data.",
  "frontend/src/pages/portal/StageTimelinePage.tsx": "Loads a project's stage data and renders a timeline of project stages with status indicators.",
  "frontend/src/pages/portal/TasksPage.tsx": "Manages project tasks with loading, creation, status updates, and grouped task lists.",
  "frontend/src/portal/useActiveProject.ts": "Hook that stores and manages the active project ID in sessionStorage with setter and clear utilities.",
  "frontend/src/toast/configureSonner.ts": "Overrides Sonner's toast.success to enforce a default 1‑second duration.",
  "frontend/src/types/model.ts": "Defines core TypeScript types and interfaces for orgs, users, CRM entities, contracts, finance transactions, and customer success models.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Describes the project’s current state, known issues, and feature requirements focused on backend client initialization and user/contact flows."
}