{
  "backend/main.mo": "Defines the backend actor with all domain types for orgs, users, CRM entities, documents, projects, deals, activities, contracts, NPS, reports, finance, support, and churn.",
  "feature_evidence.json": "Feature evidence report listing the change to update the Pipeline page header title and the files/components involved.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend files describing their purpose and behavior.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "Base HTML file setting up fonts, metadata, and mounting the React app.",
  "frontend/src/App.tsx": "Root React component configuring QueryClient, router, theming, auth, org context, and toast behavior.",
  "frontend/src/app/layout/AppShell.tsx": "Layout wrapper that conditionally displays topbar, sidebar, and bottom navigation based on authentication and route.",
  "frontend/src/app/layout/BottomNav.tsx": "Mobile bottom navigation bar with links to main sections and a button to open the mobile menu.",
  "frontend/src/app/layout/MobileNavMenu.tsx": "Slide‑in mobile navigation menu showing internal and portal sections based on user permissions.",
  "frontend/src/app/layout/Sidebar.tsx": "Desktop sidebar rendering internal and portal navigation sections with active highlighting based on current route.",
  "frontend/src/app/layout/Topbar.tsx": "Renders the top navigation bar with logo, current organization, and user dropdown including org switching and logout.",
  "frontend/src/app/router/PostAuthLanding.tsx": "Redirects authenticated users to the correct page based on role and organization status, showing a loading state meanwhile.",
  "frontend/src/app/router/ProtectedRoute.tsx": "Guards routes by checking authentication and optionally organization selection, showing loading or access-denied states.",
  "frontend/src/app/router/routes.tsx": "Defines all application routes, wrapping protected pages with layout and access control components.",
  "frontend/src/app/router/routeTree.tsx": "Empty placeholder file for router tree setup.",
  "frontend/src/auth/AuthProvider.tsx": "Provides authentication via Internet Identity, loading user profiles from backend and exposing login/logout state.",
  "frontend/src/auth/InternetIdentityAuthAdapter.ts": "Maps Internet Identity and backend profile data into the app’s unified auth user format, including role resolution.",
  "frontend/src/auth/MockAuthProvider.tsx": "Empty placeholder for a mock authentication provider.",
  "frontend/src/auth/roles.ts": "Defines application roles, metadata, and helper functions for permission checks.",
  "frontend/src/components/BrandLogo.tsx": "Displays the brand logo image with text fallback on load error.",
  "frontend/src/components/states/AccessDeniedScreen.tsx": "UI screen showing access denied message with a button to return to the home page.",
  "frontend/src/components/states/BackendClientInitState.tsx": "Handles backend initialization states, showing loading, error with retry, or rendering children when ready.",
  "frontend/src/components/states/QueryBoundary.tsx": "Wraps query-based components to show standardized loading, error, empty, or content states.",
  "frontend/src/components/states/UiStates.tsx": "Provides React UI components for loading, error, and empty states with optional messages and actions.",
  "frontend/src/config/dataMode.ts": "Defines data mode utilities that always return BACKEND and disable mock mode.",
  "frontend/src/data/api/backendClient.ts": "Implements mappings between frontend and backend data types and roles for API communication.",
  "frontend/src/data/client.ts": "Defines the unified DataClient interface and types for backend operations across projects, CRM, and documents.",
  "frontend/src/data/mock/mockClient.ts": "Empty placeholder for mock data client.",
  "frontend/src/data/mock/seed.ts": "Empty placeholder for mock seed data.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, invalidating queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and logic for login, logout, and identity management.",
  "frontend/src/hooks/useKanbanBoard.ts": "Hook for fetching a specific Kanban board and managing custom field definition updates.",
  "frontend/src/hooks/useKanbanBoards.ts": "Hook for listing, creating, and renaming Kanban boards within an organization.",
  "frontend/src/hooks/useKanbanCards.ts": "Provides React Query hooks to list, create, update, move, and delete Kanban cards with optimistic updates and toast notifications.",
  "frontend/src/hooks/usePipelineStages.ts": "Manages pipeline stage operations including listing, creating, renaming, deleting, and reordering stages using React Query.",
  "frontend/src/hooks/useStage1Client.ts": "Initializes and exposes the backend client based on the authenticated actor, returning readiness state and error handling.",
  "frontend/src/i18n/strings.ptBR.ts": "Centralized pt-BR UI strings for common actions, errors, success messages, navigation, and pipeline labels.",
  "frontend/src/index.css": "Tailwind base styling plus custom theme variables, dark mode settings, utilities, and Sonner toast adjustments.",
  "frontend/src/main.tsx": "App entry point initializing React Query and identity provider before rendering the main App component.",
  "frontend/src/org/OrgProvider.tsx": "Context provider managing current organization selection, loading from profile, and role‑based org selection requirements.",
  "frontend/src/pages/auth/CreateOrganizationPage.tsx": "Form page to create a new organization, update selection, refresh queries, and navigate after creation.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login screen using Internet Identity, redirecting authenticated users and showing a branded UI.",
  "frontend/src/pages/auth/SelectOrganizationPage.tsx": "Allows users to pick or create an organization, fetching orgs via React Query and navigating after selection.",
  "frontend/src/pages/auth/SignupPage.tsx": "Implements a signup form with validation, mock submission, and redirect to login.",
  "frontend/src/pages/internal/ActivitiesPage.tsx": "Lists and creates activities tied to an organization, supporting filters, dialogs, and related entities.",
  "frontend/src/pages/internal/ContactsPage.tsx": "Provides CRUD operations for contacts with search, dialogs, and React Query integration.",
  "frontend/src/pages/internal/ContractsPage.tsx": "Displays recurring contracts with filters, metrics, and a dialog for creating new contracts.",
  "frontend/src/pages/internal/customer-success/NpsResponseDialog.tsx": "Provides a dialog for submitting NPS responses, validating input, and handling disabled state when no active campaign exists.",
  "frontend/src/pages/internal/CustomerSuccessPage.tsx": "Manages customer success metrics including contracts, NPS campaigns, and responses with period filtering.",
  "frontend/src/pages/internal/DashboardPage.tsx": "Fetches contacts, deals, contracts, and activities to compute metrics like MRR, pipeline value, and upcoming tasks, rendering a dashboard of business stats.",
  "frontend/src/pages/internal/DealDetailPage.tsx": "Loads a specific deal and its contact, showing status, stage, values, and metadata with navigation back to the pipeline.",
  "frontend/src/pages/internal/FinancePage.tsx": "Manages finance transactions with creation, filtering, sorting, and summary metrics like income, expenses, and balance.",
  "frontend/src/pages/internal/pipeline/AddCardDialog.tsx": "Dialog for creating a new kanban card, including title, description, and custom field handling with board-level definitions.",
  "frontend/src/pages/internal/pipeline/CardEditDialog.tsx": "Dialog for editing or deleting an existing kanban card with support for due dates and custom fields synced to board definitions.",
  "frontend/src/pages/internal/pipeline/CustomFieldsEditor.tsx": "Editor component for adding, removing, and updating custom fields and their options, notifying parent components of definition updates.",
  "frontend/src/pages/internal/pipeline/KanbanCardItem.tsx": "Displays a draggable kanban card with preview info and opens the edit dialog for updates or deletion.",
  "frontend/src/pages/internal/pipeline/PipelineStageColumn.tsx": "Renders a kanban pipeline column with rename, delete, move, drag-and-drop, and card management dialogs. Handles card updates, creation, deletion, and movement between stages.",
  "frontend/src/pages/internal/PipelinePage.tsx": "Handles kanban boards and stages with creation, selection, reordering, and card management for pipeline workflow.",
  "frontend/src/pages/internal/ReportsPage.tsx": "Displays available reports, export history, and allows users to generate new reports with chosen period and format.",
  "frontend/src/pages/internal/settings/TeamManagementTab.tsx": "Displays team members and pending invitations with React Query and provides a dialog to invite new members. Currently warns that backend support for member management is incomplete.",
  "frontend/src/pages/internal/SettingsPage.tsx": "Renders the internal settings page with tabs for organization info, preferences, and team management.",
  "frontend/src/pages/portal/DeliverablesPage.tsx": "Fetches and displays project deliverables grouped by status using tabs. Shows loading, error, and empty states and supports projects selected in the portal.",
  "frontend/src/pages/portal/DocumentsPage.tsx": "Lists organization documents and provides a dialog to upload new ones with category mapping and upload progress. Uses React Query for fetching and uploading documents.",
  "frontend/src/pages/portal/KpisPage.tsx": "Fetches and displays project KPIs with trend icons and labels. Handles loading, error, empty states, and requires an active project.",
  "frontend/src/pages/portal/MeetingsPage.tsx": "Displays upcoming and past meetings for the active project and provides a dialog to create new meetings using React Query.",
  "frontend/src/pages/portal/MessagesPage.tsx": "Shows an organization’s support message thread and allows sending new messages with role-based badges.",
  "frontend/src/pages/portal/PortalSettingsPage.tsx": "Implements portal settings UI with toggles for notifications, display options, and privacy, simulating save behavior.",
  "frontend/src/pages/portal/ProjectDashboardPage.tsx": "Fetches and displays projects, lets the user select an active one, and shows key project details and stage info.",
  "frontend/src/pages/portal/StageTimelinePage.tsx": "Loads a project and renders a timeline of its stages along with basic project information.",
  "frontend/src/pages/portal/TasksPage.tsx": "React page that lists project tasks, allows creating new tasks, and updates their status using React Query mutations.",
  "frontend/src/portal/useActiveProject.ts": "Hook that manages the active project ID with sessionStorage persistence and reset support.",
  "frontend/src/toast/configureSonner.ts": "Configures global Sonner toast behavior by overriding toast.success to use a 1‑second default duration.",
  "frontend/src/types/kanbanCards.ts": "Type definitions for Kanban cards, including custom fields and inputs for create/update operations.",
  "frontend/src/types/model.ts": "Central domain model types covering orgs, users, CRM entities, tasks, activities, contracts, and more.",
  "frontend/src/types/pipelineStages.ts": "Type definitions for pipeline stages (Kanban columns) and their reordering updates.",
  "frontend/src/utils/kanbanCustomFields.ts": "Utility functions that map, normalize, and convert custom field definitions between backend and frontend formats.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support and hash routing handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Defines the project state, including schema/version info, an existing feature updating a page header title, and a pending request to rename the Pipeline page header. Contains metadata such as issues, architectural notes, and project configuration."
}