{
  "backend/main.mo": "Defines Motoko actor with data types and in‑memory maps for CRM, portal, documents, finance, and access control, including org membership helper and mixins for auth and storage.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files across authentication, data, UI states, and configuration.",
  "frontend/index.css": "Global stylesheet placeholder; currently contains no CSS.",
  "frontend/index.html": "HTML entry point loading Inter font, setting metadata, and mounting the app root.",
  "frontend/src/App.tsx": "Main React app wrapper configuring QueryClient, routing, theming, authentication, and organization context.",
  "frontend/src/app/layout/AppShell.tsx": "Layout wrapper showing Topbar, Sidebar, and BottomNav when authenticated, otherwise rendering children normally.",
  "frontend/src/app/layout/BottomNav.tsx": "Mobile bottom navigation bar with primary CRM and portal links plus a menu trigger.",
  "frontend/src/app/layout/MobileNavMenu.tsx": "Mobile slide‑in navigation menu showing internal and portal sections based on authentication and role.",
  "frontend/src/app/layout/Sidebar.tsx": "Desktop sidebar navigation listing internal and portal sections with active state highlighting based on current path.",
  "frontend/src/app/layout/Topbar.tsx": "Top navigation bar showing logo, current organization, and a user menu with logout and mock role selector.",
  "frontend/src/app/router/PostAuthLanding.tsx": "Redirects authenticated users to org selection or dashboard, and unauthenticated users to login.",
  "frontend/src/app/router/ProtectedRoute.tsx": "Guards routes by requiring authentication and optionally an organization, showing loading or access-denied states.",
  "frontend/src/app/router/routes.tsx": "Defines the app’s TanStack Router route structure, wrapping protected pages and linking all auth, internal, and portal pages.",
  "frontend/src/app/router/routeTree.tsx": "Empty route tree placeholder.",
  "frontend/src/auth/AuthProvider.tsx": "Provides authentication context, switching between mock and backend (Internet Identity) modes and managing user state.",
  "frontend/src/auth/InternetIdentityAuthAdapter.ts": "Converts Internet Identity data into the app’s user format and determines the effective role.",
  "frontend/src/auth/MockAuthProvider.tsx": "Implements mock authentication with preset users and a role selector for testing.",
  "frontend/src/auth/roles.ts": "Defines app roles, their permissions, and utility helpers for role-based access.",
  "frontend/src/components/states/AccessDeniedScreen.tsx": "UI screen showing an access-denied message with a button to return home.",
  "frontend/src/components/states/QueryBoundary.tsx": "Wrapper component standardizing loading, error, and empty states for React Query results.",
  "frontend/src/components/states/UiStates.tsx": "Defines reusable loading, error, and empty state UI components with optional messages, icons, and actions.",
  "frontend/src/config/dataMode.ts": "Provides helpers to read and determine whether the app runs in MOCK or BACKEND data mode based on environment variables.",
  "frontend/src/data/api/backendClient.ts": "Implements a client that maps Motoko backend actor calls to frontend models, including orgs, projects, profiles, and documents.",
  "frontend/src/data/client.ts": "Exports a unified data client that routes operations to either the mock client or the backend client depending on the configured mode.",
  "frontend/src/data/mock/mockClient.ts": "Implements in‑memory mock versions of backend operations using seeded data, returning Promises for compatibility.",
  "frontend/src/data/mock/seed.ts": "Contains mock seed data for organizations, users, projects, and related entities used by the mock client.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for handling Internet Identity authentication, managing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useStage1Client.ts": "Chooses between mock or backend data client based on mode and actor availability, exposing readiness and fetching states.",
  "frontend/src/i18n/strings.ptBR.ts": "Contains centralized pt-BR UI strings for actions, states, errors, success messages, auth, and navigation.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light/dark mode, typography, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider.",
  "frontend/src/org/OrgProvider.tsx": "Manages current organization state, persistence, and loading based on authentication and backend data.",
  "frontend/src/pages/auth/CreateOrganizationPage.tsx": "Form page to create an organization, update selection, refresh org list, and navigate to the dashboard.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login screen supporting mock-mode role selection or Internet Identity login, redirecting authenticated users.",
  "frontend/src/pages/auth/SelectOrganizationPage.tsx": "Lists available organizations, allows selecting or creating one, and updates backend auth when needed.",
  "frontend/src/pages/auth/SignupPage.tsx": "Signup form with validation, mock submit delay, and redirect to login.",
  "frontend/src/pages/internal/ActivitiesPage.tsx": "Lists activities, filters by status, and allows creating new activities via a dialog.",
  "frontend/src/pages/internal/ContactsPage.tsx": "Manages contacts with search, create, edit, and delete operations using React Query.",
  "frontend/src/pages/internal/ContractsPage.tsx": "Displays recurring contracts, filters by status, and shows MRR metrics with a new contract dialog.",
  "frontend/src/pages/internal/CustomerSuccessPage.tsx": "Shows customer health metrics, NPS data, and allows creating NPS campaigns.",
  "frontend/src/pages/internal/DashboardPage.tsx": "Fetches org data (contacts, deals, contracts, activities) and displays calculated business metrics and recent activity in a dashboard layout.",
  "frontend/src/pages/internal/DealDetailPage.tsx": "Loads a specific deal and its contact, showing detailed information, status, stage, and metadata with navigation back to the pipeline.",
  "frontend/src/pages/internal/FinancePage.tsx": "Manages and displays financial transactions with filtering, metrics, and dialogs to create new income or expense entries.",
  "frontend/src/pages/internal/PipelinePage.tsx": "Displays deals by stage with CRUD dialogs, filtering, and navigation to deal details using react-query for data management.",
  "frontend/src/pages/internal/ReportsPage.tsx": "Shows available reports, export history, and options for generating reports by period and format.",
  "frontend/src/pages/internal/SettingsPage.tsx": "Renders an internal settings UI with tabs for general organization info and preferences. Includes forms for editing organization details and timezone selection.",
  "frontend/src/pages/portal/DeliverablesPage.tsx": "Displays project deliverables grouped by status using React Query. Provides tab filtering and handles empty or unloaded project states.",
  "frontend/src/pages/portal/DocumentsPage.tsx": "Manages organization documents with listing, upload dialog, and category mapping. Uses React Query for fetching, uploading, and refreshing document data.",
  "frontend/src/pages/portal/KpisPage.tsx": "Shows KPIs for the active project with trend indicators and update timestamps. Fetches KPI data via React Query and handles empty or missing project states.",
  "frontend/src/pages/portal/MeetingsPage.tsx": "Lists upcoming and past project meetings and allows scheduling new meetings through a dialog. Fetches and creates meetings using React Query tied to the active project.",
  "frontend/src/pages/portal/MessagesPage.tsx": "Displays project message threads, fetches and sends messages, and shows role badges with a text input for new messages.",
  "frontend/src/pages/portal/PortalSettingsPage.tsx": "Provides UI for toggling and saving portal notification and display settings using local state.",
  "frontend/src/pages/portal/ProjectDashboardPage.tsx": "Fetches and lists projects, manages the active project selection, and shows a summary card for the selected project's status and details.",
  "frontend/src/pages/portal/StageTimelinePage.tsx": "Loads a project's details and displays its stage progression using a predefined timeline of stages.",
  "frontend/src/pages/portal/TasksPage.tsx": "Displays tasks grouped by status, supports creating tasks and updating their status, and uses dialogs for task creation.",
  "frontend/src/portal/useActiveProject.ts": "Manages the active project ID with sessionStorage persistence and provides setters and reset functionality.",
  "frontend/src/types/model.ts": "Defines TypeScript types and interfaces for orgs, users, CRM entities, customer success, and finance records.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, write, and persist URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins with extended CSS variables.",
  "project_state.json": "Describes project state, visual identity requirements, existing features, and pending feature requests for global UI updates."
}