{
  "backend/main.mo": "Defines the main actor with all domain types for users, organizations, projects, documents, deals, activities, contracts, NPS, reports, finance, support messages, and churn metrics.",
  "backend/migration.mo": "Provides type definitions for old and new actor states and includes structures to support data migration, including profile upgrades and model alignment.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of multiple frontend files, describing their purpose and role in the application architecture.",
  "frontend/index.css": "Empty stylesheet placeholder for global frontend styles.",
  "frontend/index.html": "HTML entry point defining the root element and loading the main frontend script with Inter font setup.",
  "frontend/src/App.tsx": "Initializes React app with router, theme, auth, org context, and query client setup.",
  "frontend/src/app/layout/AppShell.tsx": "Layout wrapper that renders topbar, sidebar, and bottom navigation for authenticated routes.",
  "frontend/src/app/layout/BottomNav.tsx": "Mobile bottom navigation bar with links to key sections and a button to open the mobile menu.",
  "frontend/src/app/layout/MobileNavMenu.tsx": "Mobile navigation drawer displaying internal and portal sections based on authentication and role permissions.",
  "frontend/src/app/layout/Sidebar.tsx": "Implements the sidebar navigation, showing internal or portal sections based on authentication and user roles.",
  "frontend/src/app/layout/Topbar.tsx": "Renders the top navigation bar with logo, current organization, and user menu including org switching, mock options, and logout.",
  "frontend/src/app/router/PostAuthLanding.tsx": "Redirects authenticated users to the correct page based on role and organization state, or to login if unauthenticated.",
  "frontend/src/app/router/ProtectedRoute.tsx": "Wraps routes with authentication and optional organization checks, showing loading or access-denied screens as needed.",
  "frontend/src/app/router/routes.tsx": "Defines all application routes using TanStack Router, including auth, internal, and portal pages wrapped with AppShell and protection logic.",
  "frontend/src/app/router/routeTree.tsx": "Empty or placeholder file for route tree configuration.",
  "frontend/src/auth/AuthProvider.tsx": "Provides authentication context for mock or backend modes, handling user loading, login/logout, and profile adaptation.",
  "frontend/src/auth/InternetIdentityAuthAdapter.ts": "Adapts Internet Identity data and backend profiles into the app’s unified AuthUser format, including role mapping.",
  "frontend/src/auth/MockAuthProvider.tsx": "Implements mock authentication with predefined users, plus a role selector UI for testing.",
  "frontend/src/auth/roles.ts": "Defines application roles, their permissions, and helper functions to query access capabilities.",
  "frontend/src/components/BrandLogo.tsx": "Renders the brand logo image with a fallback text display on load error.",
  "frontend/src/components/states/AccessDeniedScreen.tsx": "Displays an access‑denied alert with an optional message and a button to return to the home page.",
  "frontend/src/components/states/QueryBoundary.tsx": "Wrapper component that switches between loading, error, empty, or content states for data queries.",
  "frontend/src/components/states/UiStates.tsx": "Provides reusable loading, error, and empty state UI components with icons and optional actions.",
  "frontend/src/config/dataMode.ts": "Controls whether the app runs in MOCK or BACKEND mode based on environment configuration.",
  "frontend/src/data/api/backendClient.ts": "Implements a backend client that maps frontend models to backend actor calls and handles data conversions.",
  "frontend/src/data/client.ts": "Exports a unified data client that routes all operations to either the mock or backend client depending on mode.",
  "frontend/src/data/mock/mockClient.ts": "In‑memory mock implementation of all data operations, using seeded data and mutable arrays.",
  "frontend/src/data/mock/seed.ts": "Provides mock seed data for organizations, users, permissions, projects, and related entities for mock mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useStage1Client.ts": "Selects either a mock or backend data client based on mode and actor availability.",
  "frontend/src/i18n/strings.ptBR.ts": "Defines centralized Portuguese UI strings for actions, states, errors, and navigation.",
  "frontend/src/index.css": "Configures Tailwind layers and custom theme variables for light/dark mode, typography, and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/org/OrgProvider.tsx": "Manages the current organization selection, loading it from backend or storage and exposing helper context.",
  "frontend/src/pages/auth/CreateOrganizationPage.tsx": "UI page for creating an organization and selecting it, updating context and navigation afterward.",
  "frontend/src/pages/auth/LoginPage.tsx": "Login page that redirects authenticated users and shows either mock role selection or an Internet Identity login button.",
  "frontend/src/pages/auth/SelectOrganizationPage.tsx": "Page for listing and selecting an organization, with support for backend role syncing and navigation to creation if none exist.",
  "frontend/src/pages/auth/SignupPage.tsx": "Signup form with client-side validation and mock account creation before redirecting to login.",
  "frontend/src/pages/internal/ActivitiesPage.tsx": "Displays activities for the current organization and provides a dialog to create new activities with related entities.",
  "frontend/src/pages/internal/ContactsPage.tsx": "Manages contact list with search, filtering, creation, editing, and deletion using React Query mutations.",
  "frontend/src/pages/internal/ContractsPage.tsx": "Shows recurring contracts, filtering by status, calculating MRR metrics, and providing a modal to create new contracts.",
  "frontend/src/pages/internal/customer-success/NpsResponseDialog.tsx": "Dialog for submitting NPS responses, validating input, and handling disabled state when no active campaign exists.",
  "frontend/src/pages/internal/CustomerSuccessPage.tsx": "Renders customer success dashboards with health, NPS, and churn tabs, fetching contracts, contacts, campaigns, and responses. Supports creating NPS campaigns and responses with dialogs and filtering by date range.",
  "frontend/src/pages/internal/DashboardPage.tsx": "Displays high-level business metrics including MRR, contacts, pipeline value, and recent activities. Fetches contacts, deals, contracts, and activities to compute summaries.",
  "frontend/src/pages/internal/DealDetailPage.tsx": "Shows detailed information for a selected deal, including contact data, status, stage, and metadata. Fetches deal and related contact and provides formatted presentation.",
  "frontend/src/pages/internal/FinancePage.tsx": "Manages financial transactions with filtering, sorting, and summary metrics like income, expenses, and balance. Includes dialog for creating transactions with recurring support.",
  "frontend/src/pages/internal/PipelinePage.tsx": "Provides a full deal pipeline view with stage filtering and CRUD dialogs for creating, editing, and deleting deals. Fetches deals and contacts while supporting navigation to deal details.",
  "frontend/src/pages/internal/ReportsPage.tsx": "Lists predefined reports, allows selecting period and format, and provides export history with generation actions.",
  "frontend/src/pages/internal/SettingsPage.tsx": "Renders organization settings with tabs for general info, team, notifications, security, and integrations.",
  "frontend/src/pages/portal/DeliverablesPage.tsx": "Fetches and groups project deliverables by status and displays them in tabbed lists with loading and empty states.",
  "frontend/src/pages/portal/DocumentsPage.tsx": "Manages document listing and uploads, including category mapping, upload progress, and mutation handling.",
  "frontend/src/pages/portal/KpisPage.tsx": "Displays project KPIs using react-query, showing trend icons, labels, and update timestamps with fallback when no active project is selected.",
  "frontend/src/pages/portal/MeetingsPage.tsx": "Lists upcoming and past project meetings and allows creating new meetings via a dialog with react-query mutations.",
  "frontend/src/pages/portal/MessagesPage.tsx": "Shows an organization’s support message thread and enables sending new messages, with role-based badges and react-query updates.",
  "frontend/src/pages/portal/PortalSettingsPage.tsx": "Provides UI to toggle and save portal notification, display, and privacy settings in a tabbed interface.",
  "frontend/src/pages/portal/ProjectDashboardPage.tsx": "Loads and selects client projects, validates active project state, and displays project details and stage information.",
  "frontend/src/pages/portal/StageTimelinePage.tsx": "Page that fetches and displays a project's stages and details, showing a timeline UI with loading and error boundaries.",
  "frontend/src/pages/portal/TasksPage.tsx": "Page for listing, creating, and updating project tasks with grouping by status and dialog-based task creation.",
  "frontend/src/portal/useActiveProject.ts": "Hook managing the active project ID with sessionStorage persistence and reset helpers.",
  "frontend/src/types/model.ts": "Central TypeScript model definitions for users, orgs, CRM entities, projects, tasks, and other domain types.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind configuration defining color tokens, typography, container settings, animations, and plugin setup.",
  "project_state.json": "Defines the project’s backend goals, multi-tenant architecture, existing implemented features, and a list of pending feature requests with IDs and statuses. Captures overall build state including persistence, authentication, role-based access, and support messaging requirements."
}