{
  "backend/main.mo": "Defines the main backend actor with all core CRM, document, NPS, finance, and support data types and imports for authorization, storage, and migrations.",
  "backend/migration.mo": "Contains legacy type definitions and migration utilities for converting or updating stored data structures between versions.",
  "feature_evidence.json": "Lists implemented features with associated source files, components, test IDs, and confidence levels for traceability.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of many frontend files describing their responsibilities and recent architectural changes.",
  "frontend/index.css": "Empty stylesheet placeholder for global styling.",
  "frontend/index.html": "Base HTML document loading the React app, setting metadata, and including Google Fonts.",
  "frontend/src/App.tsx": "Root React component configuring React Query, theming, authentication, organization context, routing, and global toasts.",
  "frontend/src/app/layout/AppShell.tsx": "Layout wrapper that conditionally displays topbar, sidebar, and bottom navigation depending on authentication and route.",
  "frontend/src/app/layout/BottomNav.tsx": "Mobile bottom navigation bar with route-aware highlighting and a menu button opening the mobile nav menu.",
  "frontend/src/app/layout/MobileNavMenu.tsx": "Mobile slide-out navigation menu showing internal and portal sections based on auth and role.",
  "frontend/src/app/layout/Sidebar.tsx": "Desktop sidebar navigation with internal and portal sections, highlighting active routes.",
  "frontend/src/app/layout/Topbar.tsx": "Top navigation bar showing logo, current organization, and user account menu with logout and org switching.",
  "frontend/src/app/router/PostAuthLanding.tsx": "Redirects authenticated users to the correct screen based on role and organization state.",
  "frontend/src/app/router/ProtectedRoute.tsx": "Route guard enforcing authentication and optional organization requirement before rendering children.",
  "frontend/src/app/router/routes.tsx": "Defines all application routes using TanStack Router with auth protection and layout wrapping.",
  "frontend/src/app/router/routeTree.tsx": "Empty file placeholder for route tree configuration.",
  "frontend/src/auth/AuthProvider.tsx": "Provides authentication context using Internet Identity, loading user profile and managing login state.",
  "frontend/src/auth/InternetIdentityAuthAdapter.ts": "Converts Internet Identity and backend user profile into a unified app user with mapped roles.",
  "frontend/src/auth/MockAuthProvider.tsx": "Stub file for a mock authentication provider (empty).",
  "frontend/src/auth/roles.ts": "Defines app roles, their permissions, and helper functions to read access flags.",
  "frontend/src/components/BrandLogo.tsx": "Displays the brand logo with a text fallback if the image fails to load.",
  "frontend/src/components/dashboard/charts/BarTrendChart.tsx": "Draws a simple SVG bar chart for monthly trend data with labels.",
  "frontend/src/components/dashboard/charts/LineComparisonChart.tsx": "Displays a line chart comparing current and previous period data using SVG.",
  "frontend/src/components/dashboard/charts/Sparkline.tsx": "Renders a compact sparkline chart based on data values.",
  "frontend/src/components/dashboard/ComparisonKpiDelta.tsx": "Renders KPI delta and percent change with color-coded trend icons.",
  "frontend/src/components/dashboard/DashboardDateRangeFilter.tsx": "Provides a date-range picker with preset ranges and custom selection via popover.",
  "frontend/src/components/states/AccessDeniedScreen.tsx": "Shows an access-denied message with a button to return to the home page.",
  "frontend/src/components/states/BackendClientInitState.tsx": "Handles backend initialization states, showing loading, error with retry, or content.",
  "frontend/src/components/states/QueryBoundary.tsx": "Wraps query results with standardized loading, error, and empty state handling.",
  "frontend/src/components/states/UiStates.tsx": "Provides reusable loading, error, and empty state UI components.",
  "frontend/src/config/dataMode.ts": "Defines data mode functions always returning backend mode since mock mode is removed.",
  "frontend/src/data/api/backendClient.ts": "Implements a DataClient backed by a backendInterface, including helpers to convert custom field types between backend and frontend.",
  "frontend/src/data/client.ts": "Defines the DataClient interface and imports BackendClient as the unified backend router for app data operations.",
  "frontend/src/data/mock/mockClient.ts": "Empty placeholder file for a mock data client.",
  "frontend/src/data/mock/seed.ts": "Empty placeholder file intended for mock data seeding.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing ICP Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useKanbanBoard.ts": "Fetches a single Kanban board and manages custom field definition creation and updates with react-query.",
  "frontend/src/hooks/useKanbanBoards.ts": "Fetches and mutates lists of Kanban boards, supporting creation and renaming operations.",
  "frontend/src/hooks/useKanbanCards.ts": "Manages Kanban cards for a board, including listing, creating, updating, moving, and deleting with optimistic updates.",
  "frontend/src/hooks/usePipelineStages.ts": "Provides React Query hooks to list, create, rename, delete, and reorder pipeline stages using the Stage1 client with toast notifications.",
  "frontend/src/hooks/useReports.ts": "Implements hooks for report history, generation, download, and schedule CRUD operations via the Stage1 client and React Query.",
  "frontend/src/hooks/useStage1Client.ts": "Initializes and returns a backend data client with readiness tracking, error handling, and a proxy that blocks premature access.",
  "frontend/src/i18n/strings.ptBR.ts": "Defines centralized Brazilian Portuguese UI strings for actions, errors, success messages, navigation, and pipeline labels.",
  "frontend/src/index.css": "Configures Tailwind base styles, custom color tokens, dark mode variables, utility classes, and Sonner toast layout tweaks.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/org/OrgProvider.tsx": "Provides context for current organization selection, loading it from the backend profile and exposing selection state.",
  "frontend/src/pages/auth/CreateOrganizationPage.tsx": "UI page to create a new organization, call backend creation, update selection, and redirect after success.",
  "frontend/src/pages/auth/LoginPage.tsx": "Renders the login screen using Internet Identity authentication and redirects authenticated users.",
  "frontend/src/pages/auth/SelectOrganizationPage.tsx": "Lists organizations from the backend, lets the user select one, and navigates to the dashboard or to org creation.",
  "frontend/src/pages/auth/SignupPage.tsx": "Implements a mock signup form with validation and redirects to login on success.",
  "frontend/src/pages/internal/ActivitiesPage.tsx": "Fetches and displays activities, contacts, and deals, and provides a dialog to create new activities.",
  "frontend/src/pages/internal/ContactsPage.tsx": "Manages contact list with search, create, edit, and delete operations using React Query and dialogs.",
  "frontend/src/pages/internal/ContractsPage.tsx": "Displays recurring contracts with filtering and metrics and includes a dialog for creating new contracts.",
  "frontend/src/pages/internal/customer-success/NpsResponseDialog.tsx": "Dialog for submitting NPS responses, validating input, and handling cases with no active campaign.",
  "frontend/src/pages/internal/CustomerSuccessPage.tsx": "Shows customer success data including contracts, NPS campaigns, and responses, with tools to create campaigns and record feedback.",
  "frontend/src/pages/internal/DashboardPage.tsx": "Dashboard page that loads org data, persists date-range filters, computes metrics, and renders KPI and trend charts.",
  "frontend/src/pages/internal/DealDetailPage.tsx": "Detail view for a single deal, fetching deal and contact info and displaying metadata, status, and formatted values.",
  "frontend/src/pages/internal/FinancePage.tsx": "Finance dashboard that lists, filters, and creates income/expense transactions with recurring options and summary totals.",
  "frontend/src/pages/internal/pipeline/AddCardDialog.tsx": "Dialog for creating new kanban cards with title, description, and custom fields, syncing board-level field definitions.",
  "frontend/src/pages/internal/pipeline/CardEditDialog.tsx": "Dialog for editing kanban cards, including custom fields, due dates, and opportunity value handling.",
  "frontend/src/pages/internal/pipeline/CustomFieldsEditor.tsx": "Editor for adding, removing, and modifying custom fields with support for various field types and board-level updates.",
  "frontend/src/pages/internal/pipeline/KanbanCardItem.tsx": "Displays a draggable kanban card with summary info and opens an edit dialog for updates or deletion.",
  "frontend/src/pages/internal/pipeline/PipelineStageColumn.tsx": "UI component rendering a kanban pipeline column with card listing, drag-and-drop, rename/delete dialogs, and movement controls.",
  "frontend/src/pages/internal/PipelinePage.tsx": "Kanban-style pipeline manager that handles boards, stages, and cards with creation, reordering, persistence, and movement actions.",
  "frontend/src/pages/internal/ReportsPage.tsx": "Reports interface for generating, downloading, viewing history, and scheduling automated sales, finance, and other reports.",
  "frontend/src/pages/internal/settings/TeamManagementTab.tsx": "Team management UI with member and invitation queries plus a dialog to invite new members, pending backend support.",
  "frontend/src/pages/internal/SettingsPage.tsx": "Renders a multi‑tab settings page with organization info, preferences, and team management components.",
  "frontend/src/pages/portal/DeliverablesPage.tsx": "Displays project deliverables grouped by status with tabs, using queries and a fallback when no project is selected.",
  "frontend/src/pages/portal/DocumentsPage.tsx": "Organization documents page supporting listing and uploading files with category mapping, progress tracking, and dialog UI.",
  "frontend/src/pages/portal/KpisPage.tsx": "Shows project KPIs with trend indicators, status badges, and last-updated info, loading via project-scoped query.",
  "frontend/src/pages/portal/MeetingsPage.tsx": "Lists upcoming and past meetings for the active project and provides a dialog to schedule new meetings using React Query mutations.",
  "frontend/src/pages/portal/MessagesPage.tsx": "Displays an organization support message thread and allows sending new messages with role-based labeling.",
  "frontend/src/pages/portal/PortalSettingsPage.tsx": "Provides UI to toggle and save user portal settings for notifications, display, and privacy.",
  "frontend/src/pages/portal/ProjectDashboardPage.tsx": "Shows project selection and details for the active project, including stage, client info, and key metrics.",
  "frontend/src/pages/portal/StageTimelinePage.tsx": "Loads a project and displays its stage timeline with progress indicators and project information.",
  "frontend/src/pages/portal/TasksPage.tsx": "React page that lists tasks for the active project, supports creating tasks, updating status, and grouping tasks by status using React Query.",
  "frontend/src/portal/useActiveProject.ts": "Hook that manages the active project ID with sessionStorage persistence and helpers to set or clear it.",
  "frontend/src/toast/configureSonner.ts": "Overrides Sonner’s toast.success to apply a default 1‑second duration globally.",
  "frontend/src/types/kanbanCards.ts": "Type definitions for Kanban cards, including custom fields, card input, and update structures.",
  "frontend/src/types/model.ts": "Comprehensive shared model types for organizations, users, CRM entities, projects, activities, and more.",
  "frontend/src/types/pipelineStages.ts": "Type definitions for pipeline stages (Kanban columns) and their reorder update payload.",
  "frontend/src/types/reports.ts": "Type definitions for reports, schedules, filters, and report generation inputs.",
  "frontend/src/utils/dashboardComparison.ts": "Utility functions for computing comparison periods, deltas, percent changes, and chart aggregations.",
  "frontend/src/utils/dashboardDateRange.ts": "Utilities for handling date ranges, presets, normalization, range checks, and serialization.",
  "frontend/src/utils/dashboardMetrics.ts": "Computes dashboard KPIs and trend data using contacts, contracts, activities, and Kanban cards filtered by date range.",
  "frontend/src/utils/kanbanCustomFields.ts": "Utility functions to normalize, convert, and map custom field definitions and values between backend and frontend formats for kanban cards.",
  "frontend/src/utils/opportunityValue.ts": "Helpers for managing the numeric Opportunity Value custom field, including extraction, formatting, updating, and aggregation.",
  "frontend/src/utils/reportDownload.ts": "Provides browser download helpers for report blobs along with MIME type resolution and filename generation.",
  "frontend/src/utils/urlParams.ts": "Functions to read, persist, and clear URL parameters using both query strings and sessionStorage.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing CRM report generation features, architecture, existing features, and pending feature requests."
}