{
  "kind": "build_request",
  "title": "Implement persistent backend storage, Internet Identity auth, and role-based org access (including Firsty global access)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement durable (upgrade-safe) persistence for all backend collections used by the app so that created/edited data remains saved across canister upgrades, including organizations, user profiles, memberships, CRM entities, finance, NPS, documents, reports, and invitations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "preciso que seja construido o backend para que os dados possam ficar salvos"
        ]
      },
      "acceptanceCriteria": [
        "After deploying an upgraded canister build, previously created records (e.g., organizations, contacts, deals, contracts, finance transactions, NPS responses, documents metadata) are still retrievable.",
        "Persistence covers every data collection currently stored in in-memory Maps in backend/main.mo (no silent resets on upgrade)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend support for organization and membership management with the following rules: (1) OWNER_ADMIN and MEMBER users belong to exactly one organization; (2) FIRSTY_ADMIN and FIRSTY_CONSULTANT have access to all organizations; (3) FIRSTY_ADMIN and FIRSTY_CONSULTANT can edit data for any organization.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "se for administrador ou membro, apenas a uma empresa. Consultor first-y ou admin firsty deve ter acesso a todas as empresa"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a way to determine the caller’s effective application role (OWNER_ADMIN, MEMBER, FIRSTY_CONSULTANT, FIRSTY_ADMIN) and enforce it for all org-scoped reads/writes.",
        "Backend enforces single-organization membership for OWNER_ADMIN and MEMBER (attempts to join/create/select a second org are rejected with a clear error).",
        "FIRSTY_ADMIN and FIRSTY_CONSULTANT can list all organizations and access (read/write) org-scoped entities for any organization."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement backend APIs needed by the existing frontend data client to fully persist the app’s entities (create, list, get, update, delete where applicable) for: contacts, deals/opportunities, activities, contracts, finance transactions, NPS (campaigns and responses as currently modeled), documents (including upload metadata), reports, projects, and team invitations/members.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "contatos, oportunidade, atividade, contrato,transação, nps, tarefas, reuniões, documentos, mensagens, membros, organização."
        ]
      },
      "acceptanceCriteria": [
        "All methods that are currently stubbed or throw 'Not implemented in backend' in frontend/src/data/api/backendClient.ts have working backend implementations (or are removed from the frontend if not needed by any screen).",
        "Org access checks are applied consistently: org members can only access their org; Firsty roles can access all orgs.",
        "Create operations correctly set server-side fields that must be trusted (e.g., createdBy, timestamps) rather than trusting arbitrary client input.",
        "List endpoints return only entities belonging to the requested org (except Firsty global listing when applicable)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement support messaging persistence and routing so that messages typed in the app’s support messages field are stored and are accessible to Firsty (FIRSTY_ADMIN and FIRSTY_CONSULTANT) across all organizations, while organization users can only see their own organization’s support thread.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "mensagens de suporte no campo de mensagens.",
          "as mensagens digitadas no app serão direcionadas pra gente."
        ]
      },
      "acceptanceCriteria": [
        "An org-scoped support message thread can be listed and appended to by authorized org users.",
        "FIRSTY_ADMIN and FIRSTY_CONSULTANT can list support message threads across organizations and read/respond to them.",
        "Support messages are persisted in the backend and remain after reload and after upgrades.",
        "The existing portal messages UI (frontend/src/pages/portal/MessagesPage.tsx) uses backend mode to read/send messages without falling back to in-memory mock data."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update the frontend backend-mode integration so authentication and role resolution come from the backend (Internet Identity + backend role context), and add an organization selector/filter UX for Firsty roles to choose which organization they are currently viewing/operating on.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Consultor first-y ou admin firsty deve ter acesso a todas as empresa, pode colocar um filtro para selecionar qual."
        ]
      },
      "acceptanceCriteria": [
        "When running in BACKEND mode, the app resolves the logged-in user role using backend-provided role context (wired through the existing adaptIdentityToUser(...) path).",
        "Firsty roles can see/select any organization in the organization selection flow; non-Firsty users only see their single organization.",
        "Once a Firsty user selects an organization, all org-scoped pages (CRM, finance, NPS, documents, portal pages) load and mutate data for that selected org."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep the app’s UI language in Portuguese; do not change existing Portuguese strings to English.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if state upgrade/migration is required by the persistence changes.",
    "Authentication must use Internet Identity (no third-party auth providers)."
  ],
  "nonGoals": [
    "Implementing real-time chat (WebSockets) or push notifications.",
    "Integrating external databases or non-IC backend services.",
    "Adding new product modules beyond the listed entities (contacts, deals, activities, contracts, transactions, NPS, tasks, meetings, documents, messages, members, organization)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}