{
  "kind": "build_request",
  "title": "Implement CRM report generation with PDF/CSV export, filters, and scheduling with stored history",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend support for generating Sales, Financial, Customer Success, and Project reports from existing CRM data, with manual generation and stored report history per organization.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Preciso conseguir gerar os relatórios",
          "1-relatorio de vendas, financeiro, customer success, relatórios de projetos.",
          "3- vem dos outros campos do crm"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a report generation API that supports the four report types: sales, finance, customer_success, projects.",
        "Generated report metadata is stored per org (type, period/range, format, generatedAt, generatedBy).",
        "Report content is persisted so users can download previously generated reports later.",
        "All report operations enforce existing org access rules (member of org or Firsty staff)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend export formats for generated reports: CSV and PDF.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1- ambos"
        ]
      },
      "acceptanceCriteria": [
        "Report generation accepts a format parameter with at least: \"csv\" and \"pdf\".",
        "CSV exports are valid UTF-8 text and include a header row.",
        "PDF exports are returned/stored as a binary blob that can be downloaded and opened by standard PDF viewers.",
        "The report history records the selected export format for each generated report."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add backend scheduling for automated report generation with frequencies: daily, weekly, monthly, and custom; scheduled runs must store generated reports for later download.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3- ter possibilidade de gerar manual ou agendar/automatizar",
          "1- diario, semanal, mensal e personalizado.",
          "2-Sim"
        ]
      },
      "acceptanceCriteria": [
        "Backend supports creating, listing, updating (enable/disable), and deleting report schedules per org.",
        "A schedule can be configured as daily, weekly, monthly, or custom and includes a time-of-day setting (in a clearly defined timezone/UTC).",
        "When a schedule is due, the backend generates the report automatically and appends it to the same stored report history used by manual generation.",
        "Schedules are enforced by org access rules (only authorized org members/admins can manage schedules)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Support report filters prior to generation, including at minimum a date range filter; provide an extensible structure for additional filters (e.g., team, customer).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3- Sim"
        ]
      },
      "acceptanceCriteria": [
        "Frontend provides filter controls before generation, including a date range selector with presets and a custom range option.",
        "Backend accepts filter parameters and uses them when producing the report output and summary values.",
        "At least the date range filter affects both manual generation and scheduled generation (scheduled reports store the effective period/range used)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Wire the internal Reports page to real backend data using React Query: show available report types, allow manual generation (PDF/CSV), show export history with download action, and show scheduled reports with create/edit controls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "pode começar",
          "deve ser exportado",
          "ter possibilidade de gerar manual ou agendar/automatizar",
          "Sim"
        ]
      },
      "acceptanceCriteria": [
        "The page at route \"/relatorios\" uses backend data instead of hardcoded arrays for export history and schedules.",
        "Clicking \"Generate\" triggers report generation and displays success/error feedback; the history list refreshes after generation completes.",
        "History items include a working \"Download\" action that downloads the stored file content.",
        "Scheduled tab lists schedules from the backend and allows creating a new schedule and enabling/disabling existing schedules.",
        "All user-facing text added/changed for the Reports page is in English."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Extend the frontend DataClient and backend API bindings to include typed methods for report history, report generation, and report schedules, and use them from the Reports page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Preciso conseguir gerar os relatórios"
        ]
      },
      "acceptanceCriteria": [
        "DataClient exposes methods for: listing report history, generating a report, downloading a report file, and CRUD for schedules.",
        "BackendClient implements those methods by calling the canister interface.",
        "ReportsPage uses these DataClient methods via React Query queries/mutations (no direct actor calls inside the page)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; introduce backend/migration.mo only if state upgrades require it per the conditional migration policy.",
    "Do not edit files under frontend/src/components/ui (read-only); compose them as-is.",
    "Do not edit any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not implement third-party integrations for sending reports (email, Slack, etc.).",
    "Do not add external databases or off-chain storage providers; persist reports using existing canister storage mechanisms.",
    "Do not implement real-time updates (WebSockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}