{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deep Indigo + Inter global identity and Topbar logo replacement",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add new logo static assets under frontend/public/assets/generated with stable, UI-friendly filenames.",
      "acceptanceCriteria": [
        "The repository contains new logo assets in frontend/public/assets/generated.",
        "The filenames are stable and referenced consistently by the UI (no direct references to the raw upload filename in JSX)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/fy-logo-mark.dim_512x512.png",
          "operation": "create",
          "description": "Add the newly generated square logo mark (transparent background) as a static asset with a stable filename for UI references."
        },
        {
          "path": "frontend/public/assets/generated/fy-wordmark.dim_1200x300.png",
          "operation": "create",
          "description": "Add the newly generated horizontal wordmark (transparent background) as a static asset with a stable filename for UI references."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the global header (Topbar) to render the new logo asset(s) and keep alignment within the 64px header height.",
      "acceptanceCriteria": [
        "The Topbar no longer renders /assets/generated/firsty-logo-mark.dim_512x512.png and /assets/generated/firsty-wordmark.dim_1200x300.png; it renders the new logo asset(s) instead.",
        "The header layout remains visually aligned (logo fits within the existing 64px header height without overflow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/app/layout/Topbar.tsx",
          "operation": "modify",
          "description": "Replace the current logo <img> sources with the new static assets at frontend/public/assets/generated/fy-logo-mark.dim_512x512.png and frontend/public/assets/generated/fy-wordmark.dim_1200x300.png; ensure sizing stays within the existing h-16 header (e.g., keep mark ~32px and wordmark ~24px tall) and maintain alignment/gap."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply the Deep Indigo palette globally via Tailwind/Shadcn theme variables with high contrast and restrained Sage accent usage.",
      "acceptanceCriteria": [
        "Primary actions, active navigation states, and key highlights use the Deep Indigo primary color.",
        "Accent color (Sage Green) appears only in small highlight/accent contexts (e.g., badges, subtle indicators), not as dominant surfaces.",
        "Text/background contrast remains readable in light mode across key screens (e.g., Login, Dashboard, Documents, Settings)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global CSS theme variables to match the provided palette: Deep Indigo (#1A2B4C) as primary, Slate Gray (#3E4A59) for foreground/body text, Ice White (#F4F7F9) for backgrounds, and Sage Green (#7A918D) for accent only; also adjust any chart/support tokens to avoid neon/pink/purple hues and preserve readable contrast in light mode."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Align Tailwind color tokens with the updated theme variable strategy (e.g., ensure primary/foreground/background/muted/accent are derived from the CSS variables used by Shadcn) so components consistently pick up the new palette across the app."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Set Inter as the default sans-serif font and enforce typography hierarchy (titles semibold, subtitles medium, body regular).",
      "acceptanceCriteria": [
        "Inter is loaded by the frontend (e.g., via index.html or CSS) and used as the default sans-serif font throughout the app.",
        "Headings/titles render with semibold weight, subtitles with medium weight, and body text with regular weight (verified on at least Login and one internal page such as Dashboard)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Load the Inter font (e.g., via a font provider link tag) with weights 400 (regular), 500 (medium), and 600 (semibold) so it is available globally."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Set Inter as the default sans font family in Tailwind theme configuration so all `font-sans` usage defaults to Inter throughout the app."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Apply global typography defaults: set the app’s base font-family to Inter and establish a hierarchy where titles/headings are semibold, subtitle patterns are medium, and body text defaults to regular weight (using @layer base rules without modifying shadcn/ui components)."
        },
        {
          "path": "frontend/src/pages/auth/LoginPage.tsx",
          "operation": "modify",
          "description": "Adjust title/subtitle class usage so the Login page clearly reflects the hierarchy (CardTitle semibold; CardDescription/subtitle medium; body copy regular) while keeping existing layout intact."
        },
        {
          "path": "frontend/src/pages/internal/DashboardPage.tsx",
          "operation": "modify",
          "description": "Adjust the main page heading/subheading styles to match the hierarchy (h1 semibold; subtitle medium; avoid using extra-bold) and ensure body text remains regular."
        }
      ]
    }
  ]
}