{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend: autenticação II com contexto de role/org do backend + mensagens de suporte persistidas + seletor de organização para Firsty",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Trocar a UI de Mensagens do Portal para usar a thread de suporte persistida no backend (por organização) e permitir fluxo de leitura/envio em BACKEND mode.",
      "acceptanceCriteria": [
        "A UI de mensagens de suporte lista e permite enviar mensagens para a organização selecionada por usuários autorizados.",
        "Usuários FIRSTY_ADMIN e FIRSTY_CONSULTANT conseguem visualizar e responder usando a organização atualmente selecionada (com troca via seletor de organização).",
        "Ao recarregar a página em BACKEND mode, as mensagens continuam carregando do backend (sem fallback para mock/in-memory)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/portal/MessagesPage.tsx",
          "operation": "modify",
          "description": "Atualizar a página para exibir uma thread de suporte baseada em organização (usar currentOrgId do OrgProvider em vez de activeProjectId), ler via client.listMessages(orgId) e enviar via client.sendMessage(orgId, texto), mantendo strings em PT-BR e estados de loading/erro via QueryBoundary."
        },
        {
          "path": "frontend/src/data/api/backendClient.ts",
          "operation": "modify",
          "description": "Implementar o modo BACKEND para mensagens como mensagens de suporte: mapear listMessages(threadId) para getSupportMessages(orgId) e sendMessage(threadId, text) para sendSupportMessage(message, orgId, timestamp). Garantir que BACKEND mode não retorne arrays vazios nem lance 'Not implemented' para o fluxo de suporte. Usar os tipos do backend (SupportMessage) e mapear para o tipo Message do frontend."
        },
        {
          "path": "frontend/src/data/mock/mockClient.ts",
          "operation": "modify",
          "description": "Ajustar o mock de mensagens para aceitar orgId como 'threadId' (mantendo compatibilidade com telas existentes), para que a página de Mensagens continue funcional em modo MOCK após a troca para thread por organização."
        },
        {
          "path": "frontend/src/data/client.ts",
          "operation": "modify",
          "description": "Garantir que as assinaturas e bindings de DataClient.listMessages/sendMessage continuem coerentes após a mudança de semântica para mensagens de suporte por organização (threadId=orgId), sem introduzir novas rotas/páginas."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Em BACKEND mode, resolver autenticação/role via Internet Identity + contexto de role/org do backend e adicionar UX de seleção/filtro de organização para roles Firsty.",
      "acceptanceCriteria": [
        "Em BACKEND mode, o role do usuário vem do backend e é aplicado via caminho adaptIdentityToUser(...).",
        "FIRSTY_ADMIN e FIRSTY_CONSULTANT conseguem listar/selecionar organizações na tela de seleção; usuários não-Firsty só veem (e operam em) sua organização.",
        "Após selecionar organização como Firsty, páginas org-scoped passam a carregar/mutar dados para a organização selecionada."
      ],
      "file_operations": [
        {
          "path": "frontend/src/auth/AuthProvider.tsx",
          "operation": "modify",
          "description": "Atualizar o fluxo de BACKEND auth para obter do backend o UserProfile (incluindo appRole e currentOrgId quando disponível) e alimentar adaptIdentityToUser(identity, profile, authContext) com contexto real do backend. Usar o componente selecionado \"authorization\" para orientar o comportamento esperado (login obrigatório, carregar perfil via getCallerUserProfile, limpar cache no logout). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/auth/InternetIdentityAuthAdapter.ts",
          "operation": "modify",
          "description": "Atualizar adaptIdentityToUser(...) para resolver o AppRole a partir do contexto retornado pelo backend (ex.: profile.appRole) em BACKEND mode, mantendo fallback seguro e sem alterar strings PT-BR existentes. Usar o componente selecionado \"authorization\" como referência para o contrato de perfil/role no frontend. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/types/model.ts",
          "operation": "modify",
          "description": "Alinhar o tipo UserProfile do frontend com o que o backend fornece em BACKEND mode (incluir appRole e currentOrgId), mantendo compatibilidade com modo MOCK."
        },
        {
          "path": "frontend/src/org/OrgProvider.tsx",
          "operation": "modify",
          "description": "Em BACKEND mode, hidratar/atualizar currentOrg a partir do perfil do backend (currentOrgId) além do sessionStorage, e garantir que needsOrgSelection seja verdadeiro para roles Firsty quando não houver org selecionada (e falso para não-Firsty com org única)."
        },
        {
          "path": "frontend/src/pages/auth/SelectOrganizationPage.tsx",
          "operation": "modify",
          "description": "Implementar UX de seleção de organização compatível com roles Firsty: listar organizações acessíveis via client.listOrgs(); para não-Firsty, limitar a lista à organização do usuário (ou redirecionar automaticamente se aplicável). Ao selecionar, persistir via client.selectOrg(org.id) em BACKEND mode e atualizar OrgProvider."
        },
        {
          "path": "frontend/src/app/layout/Topbar.tsx",
          "operation": "modify",
          "description": "Adicionar acesso rápido para roles Firsty trocarem a organização (ex.: ação 'Trocar organização' que navega para /selecionar-organizacao) e exibir a organização atual de forma consistente, mantendo UI em português e sem editar componentes em frontend/src/components/ui."
        },
        {
          "path": "frontend/src/app/router/PostAuthLanding.tsx",
          "operation": "modify",
          "description": "Ajustar o redirecionamento pós-auth para respeitar o estado de seleção de organização para Firsty (ir para /selecionar-organizacao quando necessário) e manter o fluxo atual para usuários não-Firsty."
        },
        {
          "path": "frontend/src/data/api/backendClient.ts",
          "operation": "modify",
          "description": "Atualizar listOrgs() para usar a capacidade de listagem de organizações acessíveis quando disponível no backend (necessário para o seletor de org de roles Firsty), e garantir que selectOrg(orgId) persista currentOrgId no perfil (saveCallerUserProfile) em BACKEND mode."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Atualizar a definição do backendInterface no frontend para incluir a capacidade necessária para listar organizações acessíveis (conforme implementação do backend), permitindo que client.listOrgs() funcione em BACKEND mode."
        }
      ]
    }
  ]
}